In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Read The Dataset

In [3]:
dataset = pd.read_csv("D:\sandhya\Sandhya\Data-Science\csv\Social_Network_Ads_1.csv")

In [4]:
dataset

      User ID        Date   Country  Gender  Age  EstimatedSalary  Purchased
0    15624510  01-03-2012    France    Male   19          19000.0          0
1    15810944  01-04-2012     Italy    Male   35          20000.0          0
2    15668575  01-05-2012    France  Female   26          43000.0          0
3    15603246  01-06-2012   Germany  Female   27          57000.0          0
4    15804002  01-09-2012    France    Male   19          76000.0          0
..        ...         ...       ...     ...  ...              ...        ...
398  15691863  08-05-2013    France  Female   46          41000.0          1
399  15706071  08-06-2013     Italy    Male   51          23000.0          1
400  15654296  08-07-2013     Italy  Female   50          20000.0          1
401  15755018  08-08-2013   Germany    Male   36          33000.0          0
402  15594041  08-09-2013  Germany&  Female   49          36000.0          1

[403 rows x 7 columns]

In [5]:
dataset.shape

(403, 7)

In [6]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 403 entries, 0 to 402
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          403 non-null    int64
 1   Date             403 non-null    object
 2   Country          403 non-null    object
 3   Gender           403 non-null    object
 4   Age              403 non-null    int64
 5   EstimatedSalary  401 non-null    float64
 6   Purchased        403 non-null    int64
dtypes: float64(1), int64(3), object(3)
memory usage: 22.2+ KB

In [7]:
dataset.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.030000e+02  403.000000     4.010000e+02  403.000000
mean   1.569141e+07   37.692308     8.236658e+04    0.359801
std    7.153372e+04   10.475730     2.486716e+05    0.480539
min    1.556669e+07   18.000000     1.500000e+04    0.000000
25%    1.562631e+07   30.000000     4.300000e+04    0.000000
50%    1.569429e+07   37.000000     7.000000e+04    0.000000
75%    1.575020e+07   46.000000     8.800000e+04    1.000000
max    1.581524e+07   60.000000     5.000000e+06    1.000000

# Find Missing Value

In [8]:
dataset.isnull().any()

User ID            False
Date               False
Country            False
Gender             False
Age                False
EstimatedSalary     True
Purchased          False
dtype: bool

In [9]:
dataset.isnull().sum()

User ID            0
Date               0
Country            0
Gender             0
Age                0
EstimatedSalary    2
Purchased          0
dtype: int64

# Hanlding Missing value

Filling missing value with mean or median or mode

In [10]:
dataset.mean()

User ID            1.569141e+07
Age                3.769231e+01
EstimatedSalary    8.236658e+04
Purchased          3.598015e-01
dtype: float64

In [11]:
dataset.fillna(dataset.mean())

      User ID        Date   Country  Gender  Age  EstimatedSalary  Purchased
0    15624510  01-03-2012    France    Male   19          19000.0          0
1    15810944  01-04-2012     Italy    Male   35          20000.0          0
2    15668575  01-05-2012    France  Female   26          43000.0          0
3    15603246  01-06-2012   Germany  Female   27          57000.0          0
4    15804002  01-09-2012    France    Male   19          76000.0          0
..        ...         ...       ...     ...  ...              ...        ...
398  15691863  08-05-2013    France  Female   46          41000.0          1
399  15706071  08-06-2013     Italy    Male   51          23000.0          1
400  15654296  08-07-2013     Italy  Female   50          20000.0          1
401  15755018  08-08-2013   Germany    Male   36          33000.0          0
402  15594041  08-09-2013  Germany&  Female   49          36000.0          1

[403 rows x 7 columns]

In [12]:
dataset.fillna(dataset.mean() , inplace=True)

In [14]:
dataset.isnull().any()

User ID            False
Date               False
Country            False
Gender             False
Age                False
EstimatedSalary    False
Purchased          False
dtype: bool

In [15]:
dataset.median()

User ID            15694288.0
Age                      37.0
EstimatedSalary       70000.0
Purchased                 0.0
dtype: float64

In [16]:
dataset.fillna(dataset.median() , inplace=True)

In [17]:
dataset = pd.read_csv("D:\sandhya\Sandhya\Data-Science\csv\Social_Network_Ads_1.csv")

In [18]:
dataset.mode()

        User ID        Date Country  Gender   Age  EstimatedSalary  Purchased
0    15674206.0  01-02-2013   Italy  Female  35.0          72000.0        0.0
1           NaN  01-03-2012     NaN     NaN   NaN              NaN        NaN
2           NaN  01-03-2013     NaN     NaN   NaN              NaN        NaN
3           NaN  01-04-2012     NaN     NaN   NaN              NaN        NaN
4           NaN  01-04-2013     NaN     NaN   NaN              NaN        NaN
..          ...         ...     ...     ...   ...              ...        ...
398         NaN   9/24/2012     NaN     NaN   NaN              NaN        NaN
399         NaN   9/25/2012     NaN     NaN   NaN              NaN        NaN
400         NaN   9/26/2012     NaN     NaN   NaN              NaN        NaN
401         NaN   9/27/2012     NaN     NaN   NaN              NaN        NaN
402         NaN   9/28/2012     NaN     NaN   NaN              NaN        NaN

[403 rows x 7 columns]

In [19]:
dataset.fillna(dataset.median())

      User ID        Date   Country  Gender  Age  EstimatedSalary  Purchased
0    15624510  01-03-2012    France    Male   19          19000.0          0
1    15810944  01-04-2012     Italy    Male   35          20000.0          0
2    15668575  01-05-2012    France  Female   26          43000.0          0
3    15603246  01-06-2012   Germany  Female   27          57000.0          0
4    15804002  01-09-2012    France    Male   19          76000.0          0
..        ...         ...       ...     ...  ...              ...        ...
398  15691863  08-05-2013    France  Female   46          41000.0          1
399  15706071  08-06-2013     Italy    Male   51          23000.0          1
400  15654296  08-07-2013     Italy  Female   50          20000.0          1
401  15755018  08-08-2013   Germany    Male   36          33000.0          0
402  15594041  08-09-2013  Germany&  Female   49          36000.0          1

[403 rows x 7 columns]

In [23]:
dataset.mode().iloc[0,:]

User ID            1.56742e+07
Date                01-02-2013
Country                  Italy
Gender                  Female
Age                         35
EstimatedSalary          72000
Purchased                    0
Name: 0, dtype: object

In [20]:
dataset.mode()

        User ID        Date Country  Gender   Age  EstimatedSalary  Purchased
0    15674206.0  01-02-2013   Italy  Female  35.0          72000.0        0.0
1           NaN  01-03-2012     NaN     NaN   NaN              NaN        NaN
2           NaN  01-03-2013     NaN     NaN   NaN              NaN        NaN
3           NaN  01-04-2012     NaN     NaN   NaN              NaN        NaN
4           NaN  01-04-2013     NaN     NaN   NaN              NaN        NaN
..          ...         ...     ...     ...   ...              ...        ...
398         NaN   9/24/2012     NaN     NaN   NaN              NaN        NaN
399         NaN   9/25/2012     NaN     NaN   NaN              NaN        NaN
400         NaN   9/26/2012     NaN     NaN   NaN              NaN        NaN
401         NaN   9/27/2012     NaN     NaN   NaN              NaN        NaN
402         NaN   9/28/2012     NaN     NaN   NaN              NaN        NaN

[403 rows x 7 columns]

In [26]:
dataset["EstimatedSalary"].mode()

0    72000.0
dtype: float64

In [24]:
dataset.fillna(dataset.mode().iloc[0,:], inplace=True )

In [27]:
dataset.isnull().mode()

   User ID   Date  Country  Gender    Age  EstimatedSalary  Purchased
0    False  False    False   False  False            False      False

In [28]:
dataset.isnull().any()

User ID            False
Date               False
Country            False
Gender             False
Age                False
EstimatedSalary    False
Purchased          False
dtype: bool

In [29]:
dataset.mode().iloc[0,:]

User ID            1.56742e+07
Date                01-02-2013
Country                  Italy
Gender                  Female
Age                         35
EstimatedSalary          72000
Purchased                    0
Name: 0, dtype: object

In [30]:
dataset.isnull().any()

User ID            False
Date               False
Country            False
Gender             False
Age                False
EstimatedSalary    False
Purchased          False
dtype: bool

In [31]:
dataset.mode().iloc[0,:]

User ID            1.56742e+07
Date                01-02-2013
Country                  Italy
Gender                  Female
Age                         35
EstimatedSalary          72000
Purchased                    0
Name: 0, dtype: object

# Fill with Groupby

In [33]:
dataset = pd.read_csv("D:\sandhya\Sandhya\Data-Science\csv\Social_Network_Ads_1.csv")

In [34]:
dataset.isnull().any()

User ID            False
Date               False
Country            False
Gender             False
Age                False
EstimatedSalary     True
Purchased          False
dtype: bool

In [36]:
dataset

      User ID        Date   Country  Gender  Age  EstimatedSalary  Purchased
0    15624510  01-03-2012    France    Male   19          19000.0          0
1    15810944  01-04-2012     Italy    Male   35          20000.0          0
2    15668575  01-05-2012    France  Female   26          43000.0          0
3    15603246  01-06-2012   Germany  Female   27          57000.0          0
4    15804002  01-09-2012    France    Male   19          76000.0          0
..        ...         ...       ...     ...  ...              ...        ...
398  15691863  08-05-2013    France  Female   46          41000.0          1
399  15706071  08-06-2013     Italy    Male   51          23000.0          1
400  15654296  08-07-2013     Italy  Female   50          20000.0          1
401  15755018  08-08-2013   Germany    Male   36          33000.0          0
402  15594041  08-09-2013  Germany&  Female   49          36000.0          1

[403 rows x 7 columns]

In [37]:
dataset["EstimatedSalary"].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
398    False
399    False
400    False
401    False
402    False
Name: EstimatedSalary, Length: 403, dtype: bool

In [ ]:
data